from typing import Callable
import re

text = "Загальний дохід працівника складається з декількох частин: 1000.01 як основний дохід, доповнений додатковими надходженнями 27.45 і 324.00 доларів."


def sum_profit(text: str, func: Callable)-> float:  
                #Функц.приймає текст з переліком доходів (числа бути відокремлено пробілами від тексту) та функцію-генератор
    sum=0     
    for i in (func(text)):        #Ітеруємо функцію-генератор для отримання кожного значення доходу
        sum +=i
    return sum                     # Повертаємо заг.суму доходу

def generator_numbers(str:str) -> float:   
                        # Функція приймає текст з переліком доходів,отримуємо у список всі доходи
    nums = re.findall(r'\d*\.\d+|\d+', str)
    for n in nums:                            # Ітеруємо список з доходами 
        yield float(n)                        # При кожному виклику виклику повертає кожен наступний дохід у форматі дійсн.числа

total_income = sum_profit(text, generator_numbers)
print(f"Загальний дохід: {total_income}")